openfoam1/cavity_Re10/system/sampleDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}

type sets;
libs ("libsampling.so");

interpolationScheme cellPoint;

setFormat raw;

sets
(
    centerlineVertical
    {
        type    lineUniform;
        axis    y;
        start   (0.05 0 0.005);
        end     (0.05 0.1 0.005);
        nPoints 100;
    }
);

fields (U p);
